app/controllers/posts_controller.rb

   def create

   	@post = Post.new(title: params[:title], content: params[:content])

   	 if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "chris "], ["content", "je suis le meilleur "], ["created_at", "2019-10-30 12:36:08.238168"], ["updated_at", "2019-10-30 12:36:08.238168"]]