app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "description", "email", "age", "city_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    c = City.new(
    name: params[:name],
    zip_code: params[:zip_code]

)

    #p params
    #return

    @new_user = User.new(
      first_name: params[:first_name],
      last_name: params[:last_name],
      description: params[:description],
      email: params[:email],
      age: params[:age],
      city: c
    )

    if @new_user.save